{*******************************************************************************
  作者: dmzn 2007-02-02
  描述: 数据(文件)备份所需的字符串&提示等资源
*******************************************************************************}
unit run_DataRes;

interface

var
  gConfigFile: string;
  //主配置文件

Resourcestring
  cYes = 'Y';
  cNo  = 'x';
  Back_IndexFile = 'Backup.idx';
  //备份索引文件

  CRC_Start = '正在开启校验,请稍候.....';
  CRC_Running = '正在校验(CRC)数据完整性,请稍候.....';
  Zip_Start = '正在开启压缩,请稍候.....';
  Zip_Running = '正在压缩数据,请稍候.....';
  UnZip_Start = '正在读取数据,请稍候.....';
  UnZip_Running = '正在恢复数据,请稍候.....';


  Back_Welcome = '该向导将帮助您完成数据(文件)的备份操作!';
  Back_Options = '备份时可选的附加功能,以提高数据的安全性!';
  Back_Passwod = '选择适当的压缩强度或为备份添加密码保护!';
  Back_MarkStr = '请在下面的文本框中为本次备份添加备注信息!';
  Back_StaBack = '点击"开始"按钮,向导将备份指定数据(文件)!';

  Back_IsBusy  = '备份操作还没有完成,是否退出?';
  Back_MakeDir = '指定的位置(目录)不存在,是否创建?';
  Back_MDError = '无法创建指定目录';

  Back_Source  = '请选择要备份的文件';
  Back_Dest    = '请选择备份存放的位置';
  Back_DestErr = '目标文件无效';
  Back_OverWrite = '目标文件已经存在,是否覆盖?';

  Back_InputPWD = '请输入正确的密码';

  Res_Welcome = '该向导将帮助您完成数据(文件)的恢复操作!';
  Res_Options = '请在下面的备份列表中选择要还原的数据!';
  Res_MarkStr = '下面是您选中的备份的摘要信息,请认真核实!';
  Res_Passwod = '在备份数据时使用了密码保护,需要先密码验证!';
  Res_StaBack = '点击"开始"按钮,向导将恢复指定数据(文件)!';

  Res_Source = '请选择正确的索引文件';
  Res_Dest = '请选择释放的目标位置';
  Res_DestErr = '目标文件无效!';
  Res_OverWrite = '目标文件已经存在,是否覆盖?';

{-------------------------------------------------------------------------------
  备份索引文件格式描述:
  [Date]
  ;备份时间,精确到时分秒
  CRCOk = 是否启用CRC校验
  c = 校验值
  PWDOk = 是否启用密码
  PWD = 密码
  ZipRate = 压缩比率
  Source = 备份的源文件路径
  Dest = 备份的目标路径.注意:备份索引与目标文件在同一个路径下
  Mark = 备份描述
-------------------------------------------------------------------------------}

implementation

end.

